app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."supabase_id" = $1 LIMIT $2  [["supabase_id", "c8b0aded-3f84-4c1d-b616-237d14ba2005"], ["LIMIT", 1]]
---
  def set_current_user
    token = request.headers['Authorization']&.split(' ')&.last
    return unless token

    user_info = SupabaseService.get_user_info(token)

    if user_info && user_info["id"]
      @current_user = User.find_by(supabase_id: user_info["id"])