app/controllers/auth_controller.rb

  def register
    email = params[:email]
    password = params[:password]
    phone = params[:phone]
    name = params[:name]
    business_params = params.require(:business_attributes).permit(:name, :description, :phone, :email) if params[:business_attributes].present?

    if User.exists?(email: email)
      render json: { error: "A user with this email already exists" }, status: :unprocessable_entity
      return
    end

    response = SupabaseService.sign_up(email, password, phone, name)

    if response["error"] || (response["code"].present? && (response["code"] != 200 && response["code"] != 201))
      render json: { error: response["msg"] || response["error"] }, status: :unprocessable_entity
      return
    end

    supabase_user = response["user"] || response["data"] || response

    User.transaction do
      user = User.new(name: name, email: email, phone: phone, password: password, supabase_id: supabase_user["id"])
      if user.save
        if business_params.present?
          business = Business.create(business_params)
---
SELECT 1 AS one FROM "users" WHERE LOWER("users"."email") = LOWER($1) LIMIT $2  [["email", "[FILTERED]"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "email", "phone", "revenue", "revenue_type", "password", "role", "created_at", "updated_at", "supabase_id", "business_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
INSERT INTO "businesses" ("name", "description", "address", "phone", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"