app/controllers/customers_controller.rb

  def create
    customer = Customer.new(customer_params)
    customer.business_id = current_user.business_id
    if customer.save
---
INSERT INTO "customers" ("first_name", "last_name", "phone", "gender", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["first_name", "John"], ["last_name", "Doe"], ["phone", "123-456-7890"], ["gender", "male"], ["created_at", "2025-04-06 14:36:51.516488"], ["updated_at", "2025-04-06 14:36:51.516488"]]