app/controllers/dashboard_controller.rb

SELECT SUM(CASE WHEN date = '2025-05-14' THEN total_amount ELSE 0 END) AS sales_today, AVG(total_amount) AS average_sales_value, COUNT(*) AS total_transactions FROM "transactions" WHERE "transactions"."business_id" = $1 LIMIT $2  [["business_id", 1], ["LIMIT", 1]]
---
  def sales_summary
    today_range = Time.zone.now.beginning_of_day..Time.zone.now.end_of_day
    transactions = Transaction.where(business_id: @business.id, date: today_range).select(
      "SUM(total_amount) AS sales_today",
      "AVG(total_amount) AS average_sales_value",
      "COUNT(*) AS total_transactions"
    ).take

SELECT "products".* FROM "products" WHERE "products"."id" IN ($1, $2, $3, $4, $5, $6, $7)  [["id", 3], ["id", 2], ["id", 11], ["id", 8], ["id", 1], ["id", 4], ["id", 12]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."business_id" = $1 ORDER BY "transactions"."created_at" DESC LIMIT $2  [["business_id", 1], ["LIMIT", 50]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
  def recent_transactions
    limit = params[:limit].present? ? params[:limit].to_i : 50
    transactions = Transaction.where(business_id: @business.id).includes(:user, transaction_items: :product).order(created_at: :desc).limit(limit)
    data = transactions.map do |txn|
      { id: txn.id, amount: txn.total_amount, payment_method: txn.payment_method, status: txn.status, created_at: txn.created_at, customer_id: txn.customer_id,
        user: { id: txn.user_id, name: txn.user&.name },
        transaction_items: txn.transaction_items.map do |item|