app/controllers/inventory_logs_controller.rb

  def index
    @inventory_logs = InventoryLog.includes(:product).all
---
SELECT "inventory_logs".* FROM "inventory_logs"
SELECT "products".* FROM "products" WHERE "products"."id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16)  [["id", 11], ["id", 3], ["id", 2], ["id", 12], ["id", 4], ["id", 8], ["id", 1], ["id", 13], ["id", 14], ["id", 15], ["id", 10], ["id", 16], ["id", 17], ["id", 18], ["id", 19], ["id", 20]]

  def create
    @inventory_log = InventoryLog.new(inventory_log_params)
    if @inventory_log.save
---
INSERT INTO "inventory_logs" ("product_id", "change_quantity", "date", "reason", "created_at", "updated_at", "sales_transaction_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"