app/controllers/product_categories_controller.rb

  def create
    @product_category = ProductCategory.new(product_category_params)
    @product_category.business_id = current_user.business_id

    if @product_category.save
---
INSERT INTO "product_categories" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Electronics"], ["description", "All kinds of electronic gadgets and accessories."], ["created_at", "2025-04-02 05:43:06.267192"], ["updated_at", "2025-04-02 05:43:06.267192"]]