app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)
    @product.business_id = current_user.business_id
    if @product.save
      InventoryLog.create!(
        product: @product,
        change_quantity: @product.quantity,
        date: Time.current,
        reason: "Product created with initial stock"
      )
---
INSERT INTO "products" ("name", "description", "quantity", "buying_price", "product_category_id", "created_at", "updated_at", "business_id", "selling_price") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "inventory_logs" ("product_id", "change_quantity", "date", "reason", "created_at", "updated_at", "sales_transaction_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    old_quantity = @product.quantity
    if @product.update(product_params)
      if product_params[:quantity]
        quantity_diff = @product.quantity.to_i - old_quantity.to_i
        if quantity_diff != 0
          InventoryLog.create!(product: @product, change_quantity: quantity_diff, date: Time.current, reason: "Stock updated")
---
UPDATE "products" SET "quantity" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["quantity", 90], ["updated_at", "2025-04-13 11:02:05.369638"], ["id", 11]]
INSERT INTO "inventory_logs" ("product_id", "change_quantity", "date", "reason", "created_at", "updated_at", "sales_transaction_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def set_product
    @product = Product.find_by(id: params[:id], business_id: current_user.business_id)
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]