app/controllers/reports_controller.rb

  def grouped_by_category_and_payment_method
    transactions = Transaction
                     .includes(:transaction_items)
                     .where(date: @start_date..@end_date, business_id: current_user.business_id)

    grouped_data = {}

    transactions.each do |txn|
      txn.transaction_items.each do |item|
---
SELECT "transactions".* FROM "transactions" WHERE 1=1 AND "transactions"."business_id" = $1  [["business_id", 1]]

  def yearly_by_category
    start_of_year = Time.zone.now.beginning_of_year
    end_of_year = Time.zone.now.end_of_year

    transactions = Transaction
                     .includes(transaction_items: :product)
                     .where(date: start_of_year..end_of_year, business_id: current_user.business_id)

    monthly_data = {}

    transactions.each do |txn|
      month_name = txn.date.strftime("%B")
      txn.transaction_items.each do |item|
---
SELECT "products".* FROM "products" WHERE "products"."id" IN ($1, $2, $3, $4, $5, $6, $7)  [["id", 3], ["id", 2], ["id", 11], ["id", 8], ["id", 1], ["id", 4], ["id", 12]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."date" BETWEEN $1 AND $2 AND "transactions"."business_id" = $3  [["date", "2025-01-01 00:00:00"], ["date", "2025-12-31 23:59:59.999999"], ["business_id", 1]]

  def daily_by_category
    start_of_day = Time.zone.now.beginning_of_day
    end_of_day = Time.zone.now.end_of_day

    transactions = Transaction
                     .includes(transaction_items: :product)
                     .where(date: start_of_day..end_of_day, business_id: current_user.business_id)

    category_data = {}

    transactions.each do |txn|
      txn.transaction_items.each do |item|
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."date" BETWEEN $1 AND $2 AND "transactions"."business_id" = $3  [["date", "2025-05-09 00:00:00"], ["date", "2025-05-09 23:59:59.999999"], ["business_id", 1]]

  def monthly_stock_by_category
    months_back = params[:months].present? ? (params[:months])&.to_i : 5
    start_date = months_back.months.ago.beginning_of_month.to_date
    page = params[:page].to_i > 0 ? params[:page].to_i : 1
    per_page = params[:per_page].to_i > 0 ? params[:per_page].to_i : 10
    offset = (page - 1) * per_page

    sql = <<-SQL
    SELECT
      TO_CHAR(DATE_TRUNC('month', products.created_at), 'Month') AS month,
      product_categories.name AS category,
      SUM(products.quantity) AS total_quantity
    FROM products
    INNER JOIN product_categories ON product_categories.id = products.product_category_id
    WHERE products.business_id = #{current_user.business_id}
      AND products.created_at >= '#{start_date}'
    GROUP BY DATE_TRUNC('month', products.created_at), product_categories.name
    ORDER BY DATE_TRUNC('month', products.created_at) DESC
    LIMIT #{per_page} OFFSET #{offset}
    SQL

    raw_results = ActiveRecord::Base.connection.exec_query(sql).to_a
    grouped = raw_results.group_by { |row| row["month"] }
    all_categories = ProductCategory.where(business_id: current_user.business_id).pluck(:name)
---
SELECT "product_categories"."name" FROM "product_categories" WHERE "product_categories"."business_id" = $1  [["business_id", 1]]