app/controllers/roles_controller.rb

SELECT "roles".* FROM "roles"
---
  def index
    roles = Role.all

INSERT INTO "roles" ("name", "created_at", "updated_at", "description") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Editor"], ["created_at", "2025-05-10 11:13:12.923968"], ["updated_at", "2025-05-10 11:13:12.923968"], ["description", "Can edit and manage content"]]
---
  def create
    role = Role.new(role_params)
    if role.save

SELECT "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_role
    @role = Role.find(params[:id] || params[:role_id])

SELECT "permissions".* FROM "permissions" WHERE "permissions"."id" IN ($1, $2, $3)  [["id", 1], ["id", 3], ["id", 5]]
---
  def assign_permissions(role, permission_ids = nil, permission_objects = nil)
    permissions = []

    permissions += Permission.where(id: permission_ids) if permission_ids.present?