app/controllers/transactions_controller.rb

  def index
    @transactions = Transaction.includes(:transaction_items, :mpesa_transaction).where(business_id: current_user.business_id)
---
SELECT "mpesa_transactions".* FROM "mpesa_transactions" WHERE "mpesa_transactions"."id" IN ($1, $2, $3)  [["id", 1], ["id", 6], ["id", 7]]

  def create
    transaction_data = params[:transaction][:transaction_data]
    @transaction = Transaction.new(transaction_params)

    if @transaction.save
      transaction_data.each do |item_param|
        permitted_item = item_param.permit(:product_id, :quantity, :price).to_h

        @transaction.transaction_items.create!(
          permitted_item.merge(transaction_record_id: @transaction.id)
        )

        product = Product.find(permitted_item[:product_id])
        product.update!(quantity: product.quantity - permitted_item[:quantity].to_i)

        InventoryLog.create!(
          product_id: product.id,
          change_quantity: -permitted_item[:quantity].to_i,
          date: Time.current,
          reason: "Sold in transaction #{@transaction.id}",
          sales_transaction_id: @transaction.id
        )
---
INSERT INTO "transactions" ("user_id", "customer_id", "date", "total_amount", "discount", "payment_method", "status", "mpesa_transaction_id", "created_at", "updated_at", "quantity") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
SELECT "transactions".* FROM "transactions"
INSERT INTO "transaction_items" ("transaction_record_id", "product_id", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["transaction_record_id", 10], ["product_id", 1], ["quantity", 2], ["created_at", "2025-04-09 18:10:20.649693"], ["updated_at", "2025-04-09 18:10:20.649693"]]
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "products" SET "quantity" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["quantity", 93], ["updated_at", "2025-04-13 10:49:17.777238"], ["id", 3]]
INSERT INTO "inventory_logs" ("product_id", "change_quantity", "date", "reason", "created_at", "updated_at", "sales_transaction_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def set_transaction
    @transaction = Transaction.find(params[:id])
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]