app/controllers/users_controller.rb

  def index
    users = User.includes(:roles).where(business_id: current_user.business_id)
    data = users.map do |user|
      { id: user.id, name: user.name, email: user.email, phone: user.phone, created_at: user.created_at, business_id: user.business_id,
        roles: user.roles.map do |role| { id: role.id, name: role.name, description: role.description }
---
SELECT "roles".* FROM "roles" WHERE "roles"."id" IN ($1, $2, $3)  [["id", 1], ["id", 4], ["id", 5]]
SELECT "users".* FROM "users" WHERE "users"."business_id" = $1  [["business_id", 1]]

  def find_by_supabase_id
    user = User.find_by(supabase_id: params[:supabase_id], business_id: current_user&.business_id)
---
SELECT "users".* FROM "users" WHERE "users"."supabase_id" = $1 LIMIT $2  [["supabase_id", "c8b0aded-3f84-4c1d-b616-237d14ba2005"], ["LIMIT", 1]]